In [1]:
import os
import sqlite3
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import requests
from bs4 import BeautifulSoup
from IPython.display import display, Markdown

In [2]:


from src.make_db import create_movies_db

create_movies_db()

imdb_title_principals table created successfully....
imdb_name_basic table created successfully....
imdb_title_crew table created successfully....
imdb_title_ratings table created successfully....
imdb_title_basics table created successfully....
imdb_title_akas table created successfully....
tn_movie_budgets table created successfully....
tmdb_movies table created successfully....
bom_movie_gross table created successfully....
rotten_tomatoes_critic_reviews table created successfully....
rotten_tomatoes_movies table created successfully....
=========================================================
Inserting data into the imdb_title_crew table....
Inserting data into the tmdb_movies table....
Inserting data into the imdb_title_akas table....
Inserting data into the imdb_title_ratings table....
Inserting data into the imdb_name_basics table....
Inserting data into the rotten_tomatoes_movies table....
Inserting data into the rotten_tomatoes_critic_reviews table....
Inserting data into the imdb_title_basics table....
Inserting data into the tn_movie_budgets table....
Inserting data into the bom_movie_gross table....
Inserting data into the imdb_title_principals table....
=========================================================
Database created successfully!
To connect to the database: open a connection using the path "data/movies.db"

In [3]:
con = sqlite3.connect('data/movies.db')

In [21]:

df = pd.read_sql("select * from imdb_title_akas;", con)



df1 = df[df['title_id'].str.contains("tt2488496") & df['region'].str.contains("US")]
df1

,idx,title_id,ordering,title,region,language,types,attributes,is_original_title
110016,110016,tt2488496,39,Star Wars: The Force Awakens,US,None,None,poster title,0.0
110031,110031,tt2488496,52,Star Wars: Episode VII - The Force Awakens,US,None,None,None,0.0

In [56]:

df = pd.read_sql("select * from bom_movie_gross;", con)
df2 = df[df['year'] == 2010]
df2

,idx,title,studio,domestic_gross,foreign_gross,year
0,0,Toy Story 3,BV,415000000.0,652000000,2010
1,1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,3,Inception,WB,292600000.0,535700000,2010
4,4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...,...
323,323,The Taqwacores,Strand,11400.0,None,2010
324,324,Cherry,Abr.,11400.0,None,2010
325,325,Terkel in Trouble,Indic.,10800.0,None,2010
326,326,Kimjongilia,Lorb.,4400.0,None,2010
327,327,Aashayein (Wishes),Relbig.,NaN,3800,2010

In [93]:

dftn = pd.read_sql("select * from tn_movie_budgets;", con)
#dftn = dftn[dftn['production_budget'].replace(",", " ", inplace=True)]
dftn

,idx,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...,...
5777,5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [86]:
import sqlite3
import pandas as pd
import os

def create_imdb_title_principals(cursor):
    sql = '''CREATE TABLE IF NOT EXISTS imdb_title_principals (
             idx INTEGER PRIMARY KEY,
             tconst TEXT,
             ordering INTEGER,
             nconst TEXT,
             category TEXT,
             job TEXT,
             characters TEXT
             );'''
    cursor.execute(sql)
    print('imdb_title_principals table created successfully....') 

def create_imdb_name_basic(cursor):
    sql = '''CREATE TABLE IF NOT EXISTS imdb_name_basic (
             idx INTEGER PRIMARY KEY,
             nconst TEXT,
             birth_year REAL,
             death_year REAL,
             primary_profession TEXT,
             known_for_titles TEXT,
             FOREIGN KEY (nconst)
                 REFERENCES imdb_title_principals (nconst)
                 );'''
    cursor.execute(sql)
    print('imdb_name_basic table created successfully....')

def create_imdb_title_crew(cursor):
    sql = '''CREATE TABLE IF NOT EXISTS imdb_title_crew (
             idx INTEGER PRIMARY KEY,
             tconst TEXT,
             directors TEXT,
             writers TEXT,
             FOREIGN KEY (tconst)
                 REFERENCES imdb_title_principals (tconst)
                 );'''
    cursor.execute(sql)
    print('imdb_title_crew table created successfully....') 

def create_imdb_title_ratings(cursor):
    sql = '''CREATE TABLE IF NOT EXISTS imdb_title_ratings (
             idx INTEGER PRIMARY KEY,
             tconst TEXT,
             averagerating REAL,
             numvotes INTEGER,
             FOREIGN KEY (tconst)
                 REFERENCES imdb_title_principals (tconst)
                 );'''
    cursor.execute(sql)
    print('imdb_title_ratings table created successfully....') 

def create_imdb_title_basics(cursor):
    sql = '''CREATE TABLE IF NOT EXISTS imdb_title_basics (
             idx INTEGER PRIMARY KEY,
             tconst TEXT,
             primary_title TEXT,
             original_title TEXT,
             start_year INTEGER,
             runtime_minutes REAL,
             genres TEXT,
             FOREIGN KEY (tconst)
                 REFERENCES imdb_title_principals (tconst)
                 );'''
    cursor.execute(sql)
    print('imdb_title_basics table created successfully....')  

def create_imdb_title_akas(cursor):
    sql = '''CREATE TABLE IF NOT EXISTS imdb_title_akas (
             idx INTEGER PRIMARY KEY,
             title_id TEXT,
             ordering INTEGER,
             title TEXT,
             region TEXT,
             language TEXT,
             types TEXT,
             attributes TEXT,
             is_original_title REAL,
             FOREIGN KEY (title_id)
                 REFERENCES imdb_title_principals (tconst)
                 );'''
    cursor.execute(sql)
    print('imdb_title_akas table created successfully....') 

def create_tn_movie_budgets(cursor):
    sql = '''CREATE TABLE IF NOT EXISTS tn_movie_budgets (
             idx INTEGER PRIMARY KEY,
             id INTEGER,
             release_date TEXT,
             movie TEXT,
             production_budget TEXT,
             domestic_gross TEXT,
             worldwide_gross TEXT,
             FOREIGN KEY (movie)
                 REFERENCES imdb_title_basics (primary_title)
             );'''
    cursor.execute(sql)
    print('tn_movie_budgets table created successfully....')  

def create_tmdb_movies(cursor):
    sql = '''CREATE TABLE IF NOT EXISTS tmdb_movies (
             idx INTEGER PRIMARY KEY,
             genre_ids TEXT,
             id INTEGER,
             original_language TEXT,
             original_title TEXT,
             popularity REAL,
             release_date TEXT,
             title TEXT,
             vote_average REAL,
             vote_count INTEGER,
             FOREIGN KEY (title)
                 REFERENCES imdb_title_basics (primary_title)
             );'''
    cursor.execute(sql)
    print('tmdb_movies table created successfully....')  

def bom_movie_gross(cursor):
    sql = '''CREATE TABLE IF NOT EXISTS bom_movie_gross (
             idx INTEGER PRIMARY KEY,
             title TEXT,
             studio TEXT,
             domestic_gross REAL,
             foreign_gross TEXT,
             year INTEGER,
             FOREIGN KEY (title)
                 REFERENCES imdb_title_basics (primary_title)
                 );'''
    cursor.execute(sql)
    print('bom_movie_gross table created successfully....')

def create_rotten_tomatoes_critic_reviews(cursor):
    sql = '''CREATE TABLE IF NOT EXISTS rotten_tomatoes_critic_reviews (
             idx INTEGER PRIMARY KEY,
             rotten_tomatoes_link TEXT,
             critic_name TEXT,
             top_critic INTEGER,
             publisher_name TEXT,
             review_type TEXT,
             review_score TEXT,
             review_date TEXT,
             review_content TEXT
             );'''
    cursor.execute(sql)
    print('rotten_tomatoes_critic_reviews table created successfully....') 

def create_rotten_tomatoes_movies(cursor):
    sql = '''CREATE TABLE IF NOT EXISTS rotten_tomatoes_movies (
             idx INTEGER PRIMARY KEY,
             rotten_tomatoes_link TEXT,
             movie_title TEXT,
             movie_info TEXT,
             critics_consensus TEXT,
             content_rating TEXT,
             genres TEXT,
             directors TEXT,
             authors TEXT,
             actors TEXT,
             original_release_date TEXT,
             streaming_release_date TEXT,
             runtime REAL,
             production_company TEXT,
             tomatometer_status TEXT,
             tomatometer_rating REAL,
             tomatometer_count REAL,
             audience_status TEXT,
             audience_rating REAL,
             audience_count REAL,
             tomatometer_top_critics_count INTEGER,
             tomatometer_fresh_critics_count INTEGER,
             tomatometer_rotten_critics_count INTEGER,
             FOREIGN KEY (rotten_tomatoes_link)
                 REFERENCES rotten_tomatoes_critic_reviews (rotten_tomatoes_link)
                 );'''
    cursor.execute(sql)
    print('rotten_tomatoes_movies table created successfully....')  

def create_tables(cursor):
    tables = list(cursor.execute("select name from sqlite_master where type is 'table'"))
    cursor.executescript(';'.join(["drop table if exists %s" %i for i in tables]))
    create_imdb_title_principals(cursor)
    create_imdb_name_basic(cursor)
    create_imdb_title_crew(cursor)
    create_imdb_title_ratings(cursor)
    create_imdb_title_basics(cursor)
    create_imdb_title_akas(cursor)
    create_tn_movie_budgets(cursor)
    create_tmdb_movies(cursor)
    bom_movie_gross(cursor)
    create_rotten_tomatoes_critic_reviews(cursor)
    create_rotten_tomatoes_movies(cursor)

name_map = {'imdb.title.crew.csv.gz': 'imdb_title_crew',
 'tmdb.movies.csv.gz': 'tmdb_movies',
 'imdb.title.akas.csv.gz': 'imdb_title_akas',
 'imdb.title.ratings.csv.gz': 'imdb_title_ratings',
 'imdb.name.basics.csv.gz': 'imdb_name_basics',
 'rotten_tomatoes_movies.csv.gz':'rotten_tomatoes_movies',
 'rotten_tomatoes_critic_reviews.csv.gz': 'rotten_tomatoes_critic_reviews',
 'imdb.title.basics.csv.gz': 'imdb_title_basics',
 'tn.movie_budgets.csv.gz': 'tn_movie_budgets',
 'bom.movie_gross.csv.gz': 'bom_movie_gross',
 'imdb.title.principals.csv.gz': 'imdb_title_principals'}



def create_movies_db():
    db_path = os.path.join('data', 'movies.db')
    conn = sqlite3.connect(db_path)  
    cursor = conn.cursor()
    create_tables(cursor) 
    print('=========================================================')
    for name in name_map:
        file_path = os.path.join('data', 'zippedData', name)
        print(f'Inserting data into the {name_map[name]} table....')
        pd.read_csv(file_path).to_sql(name_map[name], conn, if_exists='append', index_label='idx')
    print('=========================================================')
    print(f'Database created successfully!\nTo connect to the database: open a connection using the path "{db_path}"')